//Спринт 2/15 → Тема 1/6: Условный оператор → Урок 4/6
//Квиз 2/3

package main

import "fmt"

func main() {

	var a bool
	var b bool

	k1 := !a || !b
	l1 := !a || (b && !a)
	m1 := !(a && b)
	n1 := (b || a) && !b
	p1 := !b || !a
	r1 := !a || (a && b) || !b
	fmt.Printf("%t\t%t\t%t\t%t\t%t\t%t\n", k1, l1, m1, n1, p1, r1)

	a = true

	k2 := !a || !b
	l2 := !a || (b && !a)
	m2 := !(a && b)
	n2 := (b || a) && !b
	p2 := !b || !a
	r2 := !a || (a && b) || !b
	fmt.Printf("%t\t%t\t%t\t%t\t%t\t%t\n", k2, l2, m2, n2, p2, r2)

	b = a

	k3 := !a || !b
	l3 := !a || (b && !a)
	m3 := !(a && b)
	n3 := (b || a) && !b
	p3 := !b || !a
	r3 := !a || (a && b) || !b
	fmt.Printf("%t\t%t\t%t\t%t\t%t\t%t\n\n", k3, l3, m3, n3, p3, r3)

	if (k1 == l1) && (k2 == l2) && (k3 == l3) {
		fmt.Printf("при любых значениях a и b, выражение \"!a || (b && !a)\" эквивалентно \"!a || !b\"\n")
	} else {
		fmt.Printf("выражение \"!a || (b && !a)\" - не подходит\n")
	}

	if (k1 == m1) && (k2 == m2) && (k3 == m3) {
		fmt.Printf("при любых значениях a и b, выражение \"!(a && b)\" эквивалентно \"!a || !b\"\n")
	} else {
		fmt.Printf("выражение \"!(a && b)\" не подходит\n")
	}

	if (k1 == n1) && (k2 == n2) && (k3 == n3) {
		fmt.Printf("при любых значениях a и b, выражение \"(b || a) && !b\" эквивалентно \"!a || !b\"\n")
	} else {
		fmt.Printf("выражение \"(b || a) && !b\" - не подходит\n")
	}

	if (k1 == p1) && (k2 == p2) && (k3 == p3) {
		fmt.Printf("при любых значениях a и b, выражение \"!b || !a\" эквивалентно \"!a || !b\"\n")
	} else {
		fmt.Printf("выражение \"!b || !a\" - не подходит\n")
	}

	if (k1 == r1) && (k2 == r2) && (k3 == r3) {
		fmt.Printf("при любых значениях a и b, выражение \"!a || (a && b) || !b\" эквивалентно \"!a || !b\"\n")
	} else {
		fmt.Printf("выражение \"!a || (a && b) || !b\" - не подходит\n")
	}
}
